src/Documents/InvoicePayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>InvoicePayment</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompanyCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhysicalCheckNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Voided</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DwollaTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Balance</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BalanceFCY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/GeneralJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccountingRegister>
		<Properties>
			<Name>GeneralJournal</Name>
			<ChartOfAccounts>ChartOfAccounts.ChartOfAccounts</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Documents/InvoicePayment/Ext/ManagerModule.bsl
Procedure PrintCheck(Spreadsheet, Ref) Export

	Template = Documents.InvoicePayment.GetTemplate("PrintCheck");
	Query = New Query;
	Query.Text =
	"SELECT
	|	InvoicePayment.Date,
	|	InvoicePayment.Company,
	|	InvoicePayment.DocumentTotalRC,
	|	InvoicePayment.Memo,
	|	InvoicePayment.LineItems.(
	|		Ref,
	|		LineNumber,
	|		Document,
	|		Document.Date,
	|		Document.Number,
	|		VALUETYPE(InvoicePayment.LineItems.Document) AS DocType,
	|		Document.DocumentTotalRC,
	|		Payment,
	|		Balance,
	|		BalanceFCY,
	|		Currency
	|	),
	|	InvoicePayment.BankAccount.Description As BankDesc
	|FROM
	|	Document.InvoicePayment AS InvoicePayment
	|WHERE
	|	InvoicePayment.Ref IN(&Ref)";
	Query.Parameters.Insert("Ref", Ref);
	
	//Selection = Query.Execute().Unload();
	
	Selection = Query.Execute().Choose();
	
	/////
	AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	Header2 = Template.GetArea("Header2");
	EndStatement = Template.GetArea("EndStatement");
	EndStatement2 = Template.GetArea("EndStatement2");

	Spreadsheet.Clear();
	InsertPageBreak = False;
	While Selection.Next() Do
		If InsertPageBreak Then
			Spreadsheet.PutHorizontalPageBreak();
		EndIf;
		
		Spreadsheet.LeftMargin = 17 + Constants.CheckHorizontalAdj.Get();
		Spreadsheet.TopMargin = 15 + Constants.CheckVerticalAdj.Get();
		
		ThemBill = PrintTemplates.ContactInfoDataset(Selection.Company, "ThemBill", Catalogs.Addresses.EmptyRef());
		
		Spreadsheet.Put(AreaCaption);

		Header.Parameters.Fill(Selection);
		Header.Parameters.Fill(ThemBill);
		
		numtostr = string(Selection.DocumentTotalRC);
		Result = StrOccurrenceCount(numtostr,".");	
			
		ParametersSubject="dollar and, dollars and, cent, cents, 2";
		
		Rawamount = NumberInWords(Selection.DocumentTotalRC,,ParametersSubject);
		
		If Selection.DocumentTotalRC > 1 Then
			Rawamount = StrReplace(Rawamount,"dollar ","dollars ");
		Endif;

		
		For	i = StrLen(Rawamount) To 110 Do
			Rawamount = Rawamount + "*";
		EndDo;
				
		Header.Parameters.WrittenAmount = "**" + Rawamount;
		
		FormattedNum = Format(Selection.DocumentTotalRC, "NFD=2");
		Header.Parameters.DocumentTotalRC = "**" + FormattedNum + "**";
		
		//If Result = 0 Then
		//	Header.Parameters.DocumentTotalRC = "**" + Selection.DocumentTotalRC + ".00**";
		//Else
		//	FormattedNum = Format(Selection.DocumentTotalRC, "NFD=2");
		//	Header.Parameters.DocumentTotalRC = "**" + FormattedNum + "**";

		//Endif;	
				
		RemitTo = ThemBill.RemitTo;
		
		If RemitTo <> "" Then
			Header.Parameters.RemitTo = RemitTo;
		Else
			Header.Parameters.RemitTo = ThemBill.ThemName;
		Endif;
		
		//Header.Parameters.BankAccount = Selection.BankDesc;
		
		Spreadsheet.Put(Header, Selection.Level());		
		
		
//InvoicePayment Fill
	SelectionLineItems = Selection.LineItems.Choose();
	 
	TemplateBills = Template.GetArea("Bills");
	InvoiceCount = 0;
	 While SelectionLineItems.Next() Do
	 	FormattedDate = Format(SelectionLineItems.Document.Date, "DF=""dd/MM/yyyy""");		                    
	 	//TemplateBills.Parameters.InvoiceDate = SelectionLineItems.Document.Date;
	 	TemplateBills.Parameters.InvoiceDate = FormattedDate;

	 	TemplateBills.Parameters.Type = SelectionLineItems.DocType;
	 	TemplateBills.Parameters.ReferenceNum = SelectionLineItems.Document.Number;
	 	TemplateBills.Parameters.Payment = SelectionLineItems.Payment;
	 	
	    	Query2 = New Query;
	    	Query2.Text =
	    	"SELECT
	    	|	GeneralJournalBalance.AmountRCBalance * -1 AS Balance
	    	|FROM
	    	|	AccountingRegister.GeneralJournal.Balance AS GeneralJournalBalance
	    	|WHERE
	    	|	GeneralJournalBalance.ExtDimension2 = &Ref2";
	    	
	    	Query2.Parameters.Insert("Ref2", SelectionLineItems.Document);
	    	Query2Result = Query2.Execute();
	    	If Query2Result.IsEmpty() Then
	    		BalanceD = 0;
	    	Else
	    		BalanceD = Query2.Execute().Unload()[0][0];
	    	EndIf;


	 	
	 	numtostr = string(SelectionLineItems.Document.DocumentTotalRC);
	 	Result = StrOccurrenceCount(numtostr,".");
	    
		FormattedNum = Format(BalanceD, "NFD=2");
		TemplateBills.Parameters.BalDue = FormattedNum;

		
	 	numtostr = string(SelectionLineItems.Document.DocumentTotalRC);
	 	Result = StrOccurrenceCount(numtostr,".");
	    
		FormattedNum = Format(SelectionLineItems.Document.DocumentTotalRC, "NFD=2");
		TemplateBills.Parameters.OrigAmount = FormattedNum;
	
	 			 
	 	Spreadsheet.Put(TemplateBills, SelectionLineItems.Level());
	 	InvoiceCount = InvoiceCount + 1;
	 	
	 EndDo;
	 
	   //TemplateArea = Template.GetArea("EmptyArea");
	   //  Spreadsheet.Put(TemplateArea);
		 FillArea = Template.GetArea("FillArea");
		 For I = InvoiceCount To 20 Do
			Spreadsheet.Put(FillArea);
		 EndDo;
		 
		 EndStatement.Parameters.BankAccount = Selection.BankDesc;
		 EndStatement.Parameters.Memo = Selection.Memo;
		 EndStatement.Parameters.DocumentTotalRC2 = Selection.DocumentTotalRC;
		 Spreadsheet.Put(EndStatement);
		 
		 
		 TemplateArea = Template.GetArea("EmptyArea3");
		 Spreadsheet.Put(TemplateArea);

		 
		 Head2 = Template.GetArea("Header2");
		 Head2.Parameters.Date = Selection.Date;
		 Head2.Parameters.RemitTo = RemitTo;
		 Spreadsheet.Put(Head2);
		 
//Second InvoiceFill
	SelectionLineItems = Selection.LineItems.Choose();
	 
	TemplateBills = Template.GetArea("Bills2");
	InvoiceCount = 0;
	 While SelectionLineItems.Next() Do
	 			 
	 	FormattedDate = Format(SelectionLineItems.Document.Date, "DF=""dd/MM/yyyy""");		                    
	 	//TemplateBills.Parameters.InvoiceDate = SelectionLineItems.Document.Date;
	 	TemplateBills.Parameters.InvoiceDate = FormattedDate;

	 	TemplateBills.Parameters.Type = SelectionLineItems.DocType;
	 	TemplateBills.Parameters.ReferenceNum = SelectionLineItems.Document.Number;
	 	TemplateBills.Parameters.Payment = SelectionLineItems.Payment;
	 	
	    	Query2 = New Query;
	    	Query2.Text =
	    	"SELECT
	    	|	GeneralJournalBalance.AmountRCBalance * -1 AS Balance
	    	|FROM
	    	|	AccountingRegister.GeneralJournal.Balance AS GeneralJournalBalance
	    	|WHERE
	    	|	GeneralJournalBalance.ExtDimension2 = &Ref2";
	    	
	    	Query2.Parameters.Insert("Ref2", SelectionLineItems.Document);
	    	Query2Result = Query2.Execute();
	    	If Query2Result.IsEmpty() Then
	    		BalanceD = 0;
	    	Else
	    		BalanceD = Query2.Execute().Unload()[0][0];
	    	EndIf;


	 	
	 	numtostr = string(SelectionLineItems.Document.DocumentTotalRC);
	 	Result = StrOccurrenceCount(numtostr,".");
	    
		FormattedNum = Format(BalanceD, "NFD=2");
		TemplateBills.Parameters.BalDue = FormattedNum;	
		
	 	numtostr = string(SelectionLineItems.Document.DocumentTotalRC);
	 	Result = StrOccurrenceCount(numtostr,".");
	    
		FormattedNum = Format(SelectionLineItems.Document.DocumentTotalRC, "NFD=2");
		TemplateBills.Parameters.OrigAmount = FormattedNum;
	
			    	 			 
	 	Spreadsheet.Put(TemplateBills, SelectionLineItems.Level());
	 	InvoiceCount = InvoiceCount + 1;
	 	
	EndDo;
//

		For I = InvoiceCount To 19 Do
			Spreadsheet.Put(FillArea);
		EndDo;
		
		 EndStatement2.Parameters.BankAccount = Selection.BankDesc;
		 EndStatement2.Parameters.Memo = Selection.Memo;
		 EndStatement2.Parameters.DocumentTotalRC2 = Selection.DocumentTotalRC;
		 
		 Spreadsheet.Put(EndStatement2);


		InsertPageBreak = True;
	EndDo;
	

EndProcedure
